OpenFOAM-8/chapter5/propeller/system/streamLines
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

streamLines
{
    libs            ("libfieldFunctionObjects.so");

    type            streamLine;

     // Output every
    writeControl    writeTime;
    writeInterval 1;

    setFormat       vtk; //gnuplot; //xmgr; //raw; //jplot;

    // Track forward (+U) or backward (-U) or both
    direction       forward;

    // Names of fields to sample. Should contain above velocity field!
    fields (p U);

    // Steps particles can travel before being removed
    lifeTime        10000;

    // Number of steps per cell (estimate). Set to 1 to disable subcycling.
    nSubCycle 5;

    // Cloud name to use
    cloudName       particleTracks;


     // Output every
    writeControl    writeTime;
  
  
   seedSampleSet
    {

/*        type        uniform;
        axis        x;  //distance;

        // Note: tracks slightly offset so as not to be on a face
        start       (-1.0 0 -3);
        end         ( 1.0 0 -3);
        nPoints     100;*/

/*      type        circle;
        origin	    (0 0 -1.0);
        circleAxis  (0 0 1);  //distance;
        axis        x;   
        startPoint	(-0.65 0 -1.0);
        dTheta	5;	 
*/

/*
sample types in openfoam old versions (OF < 7)
circle
cloud
face
midPoint
midPointAndFace
patchCloud
polyLine
triSurfaceMeshPointSet
uniform*/


	type        circleRandom;
        centre	    (0 0 -1.0);
        normal  (0 0 1);  //distance;
	radius   0.65;
	nPoints  72;
        axis        z;   
        //startPoint	(-0.65 0 -1.0);
        //dTheta	5;
/*
sample types in openfoam (OF-7)
12   
(
arcUniform
boundaryPoints
boundaryRandom
boxUniform
circleRandom
lineCell
lineCellFace
lineFace
lineUniform
points
sphereRandom
triSurfaceMesh
)
*/

  }

}


// ************************************************************************* //
